#include "gd32f1x0.h"
#include "Common.h"


//*******************************************************************
//作用：看门狗初始化
//参数：无
//返回：无
//*******************************************************************
void BSPWatchDogInit(void)
{
//	fwdgt_config(0x0FFF, FWDGT_PSC_DIV32);
//	fwdgt_counter_reload();
//	fwdgt_write_disable();
//	fwdgt_enable();
}

//*******************************************************************
//作用：看门狗复位
//参数：无
//返回：无
//*******************************************************************
void BSPWatchDogReset(void)
{
//	fwdgt_counter_reload();
}

