#ifndef	__WATCHDOG_H__
#define	__WATCHDOG_H__	1


#include "Common.h"
#include "BSP.h"


//*******************************************************************
//作用：看门狗初始化
//参数：无
//返回：无
//*******************************************************************
extern void BSPWatchDogInit(void);
//*******************************************************************
//作用：看门狗复位
//参数：无
//返回：无
//*******************************************************************
extern void BSPWatchDogReset(void);


#endif



